microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51N19A.atdf
        <register name="PINTFLAG" offset="0x7" rw="RW" size="1" atomic-op="clear:PINTFLAG" initval="0x00" caption="HOST_PIPE Pipe Interrupt Flag">
          <bitfield name="TRCPT0" caption="Transfer Complete 0 Interrupt Flag" mask="0x1"/>
          <bitfield name="TRCPT1" caption="Transfer Complete 1 Interrupt Flag" mask="0x2"/>
          <bitfield name="TRFAIL" caption="Error Flow Interrupt Flag" mask="0x4"/>
          <bitfield name="PERR" caption="Pipe Error Interrupt Flag" mask="0x8"/>
          <bitfield name="TXSTP" caption="Transmit  Setup Interrupt Flag" mask="0x10"/>
          <bitfield name="STALL" caption="Stall Interrupt Flag" mask="0x20"/>
        </register>
        <register name="PINTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:PINTENCLR" initval="0x00" caption="HOST_PIPE Pipe Interrupt Flag Clear">
          <bitfield name="TRCPT0" caption="Transfer Complete 0 Disable" mask="0x1"/>
          <bitfield name="TRCPT1" caption="Transfer Complete 1 Disable" mask="0x2"/>
          <bitfield name="TRFAIL" caption="Error Flow Interrupt Disable" mask="0x4"/>
          <bitfield name="PERR" caption="Pipe Error Interrupt Disable" mask="0x8"/>
          <bitfield name="TXSTP" caption="Transmit Setup Interrupt Disable" mask="0x10"/>
          <bitfield name="STALL" caption="Stall Inetrrupt Disable" mask="0x20"/>
        </register>
        <register name="PINTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:PINTENSET" initval="0x00" caption="HOST_PIPE Pipe Interrupt Flag Set">
          <bitfield name="TRCPT0" caption="Transfer Complete 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="TRCPT1" caption="Transfer Complete 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="TRFAIL" caption="Error Flow Interrupt Enable" mask="0x4"/>
          <bitfield name="PERR" caption="Pipe Error Interrupt Enable" mask="0x8"/>
          <bitfield name="TXSTP" caption="Transmit  Setup Interrupt Enable" mask="0x10"/>
          <bitfield name="STALL" caption="Stall Interrupt Enable" mask="0x20"/>
        </register>
      </register-group>
      <register-group class="union" union-tag="USB.CTRLA.MODE" name="USB" caption="Universal Serial Bus">
        <register-group name="DEVICE" name-in-module="USB_DEVICE" union-tag-value="0" offset="0"/>
        <register-group name="HOST" name-in-module="USB_HOST" union-tag-value="1" offset="0"/>
      </register-group>
      <register-group name="USB_DEVICE" caption="Universal Serial Bus - USB is Device">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby Mode" mask="0x4"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x80" values="USB_CTRLA__MODE"/>
        </register>
        <register name="SYNCBUSY" offset="0x2" rw="R" size="1" initval="0x00" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2"/>
        </register>
        <register name="QOSCTRL" offset="0x3" rw="RW" size="1" initval="0x0F" caption="USB Quality Of Service">
          <bitfield name="CQOS" caption="Configuration Quality of Service" mask="0x3"/>
          <bitfield name="DQOS" caption="Data Quality of Service" mask="0xC"/>
        </register>
        <register name="CTRLB" offset="0x8" rw="RW" size="2" initval="0x0001" caption="DEVICE Control B">
          <bitfield name="DETACH" caption="Detach" mask="0x1"/>
          <bitfield name="UPRSM" caption="Upstream Resume" mask="0x2"/>
          <bitfield name="SPDCONF" caption="Speed Configuration" mask="0xC" values="USB_DEVICE_CTRLB__SPDCONF"/>
          <bitfield name="NREPLY" caption="No Reply" mask="0x10"/>
          <bitfield name="TSTJ" caption="Test mode J" mask="0x20"/>
          <bitfield name="TSTK" caption="Test mode K" mask="0x40"/>
          <bitfield name="TSTPCKT" caption="Test packet mode" mask="0x80"/>
          <bitfield name="OPMODE2" caption="Specific Operational Mode" mask="0x100"/>
          <bitfield name="GNAK" caption="Global NAK" mask="0x200"/>
          <bitfield name="LPMHDSK" caption="Link Power Management Handshake" mask="0xC00" values="USB_DEVICE_CTRLB__LPMHDSK"/>
        </register>
        <register name="DADD" offset="0xA" rw="RW" size="1" initval="0x00" caption="DEVICE Device Address">
          <bitfield name="DADD" caption="Device Address" mask="0x7F"/>
          <bitfield name="ADDEN" caption="Device Address Enable" mask="0x80"/>
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="1" initval="0x40" caption="DEVICE Status">
          <bitfield name="SPEED" caption="Speed Status" mask="0xC" values="USB_DEVICE_STATUS__SPEED"/>
          <bitfield name="LINESTATE" caption="USB Line State Status" mask="0xC0" values="USB_DEVICE_STATUS__LINESTATE"/>
        </register>
        <register name="FSMSTATUS" offset="0xD" rw="R" size="1" initval="0x01" caption="Finite State Machine Status">
          <bitfield name="FSMSTATE" caption="Fine State Machine Status" mask="0x7F" values="USB_FSMSTATUS__FSMSTATE"/>
        </register>
        <register name="FNUM" offset="0x10" rw="R" size="2" initval="0x0000" caption="DEVICE Device Frame Number">
          <bitfield name="MFNUM" caption="Micro Frame Number" mask="0x7"/>
          <bitfield name="FNUM" caption="Frame Number" mask="0x3FF8"/>
          <bitfield name="FNCERR" caption="Frame Number CRC Error" mask="0x8000"/>
        </register>
        <register name="INTENCLR" offset="0x14" rw="RW" size="2" atomic-op="clear:INTENCLR" initval="0x0000" caption="DEVICE Device Interrupt Enable Clear">
          <bitfield name="SUSPEND" caption="Suspend Interrupt Enable" mask="0x1"/>
          <bitfield name="MSOF" caption="Micro Start of Frame Interrupt Enable in High Speed Mode" mask="0x2"/>
          <bitfield name="SOF" caption="Start Of Frame Interrupt Enable" mask="0x4"/>
          <bitfield name="EORST" caption="End of Reset Interrupt Enable" mask="0x8"/>
          <bitfield name="WAKEUP" caption="Wake Up Interrupt Enable" mask="0x10"/>
          <bitfield name="EORSM" caption="End Of Resume Interrupt Enable" mask="0x20"/>
          <bitfield name="UPRSM" caption="Upstream Resume Interrupt Enable" mask="0x40"/>
          <bitfield name="RAMACER" caption="Ram Access Interrupt Enable" mask="0x80"/>
          <bitfield name="LPMNYET" caption="Link Power Management Not Yet Interrupt Enable" mask="0x100"/>
          <bitfield name="LPMSUSP" caption="Link Power Management Suspend Interrupt Enable" mask="0x200"/>
        </register>
        <register name="INTENSET" offset="0x18" rw="RW" size="2" atomic-op="set:INTENSET" initval="0x0000" caption="DEVICE Device Interrupt Enable Set">
          <bitfield name="SUSPEND" caption="Suspend Interrupt Enable" mask="0x1"/>
          <bitfield name="MSOF" caption="Micro Start of Frame Interrupt Enable in High Speed Mode" mask="0x2"/>
          <bitfield name="SOF" caption="Start Of Frame Interrupt Enable" mask="0x4"/>
          <bitfield name="EORST" caption="End of Reset Interrupt Enable" mask="0x8"/>
          <bitfield name="WAKEUP" caption="Wake Up Interrupt Enable" mask="0x10"/>
          <bitfield name="EORSM" caption="End Of Resume Interrupt Enable" mask="0x20"/>
          <bitfield name="UPRSM" caption="Upstream Resume Interrupt Enable" mask="0x40"/>
          <bitfield name="RAMACER" caption="Ram Access Interrupt Enable" mask="0x80"/>
          <bitfield name="LPMNYET" caption="Link Power Management Not Yet Interrupt Enable" mask="0x100"/>
          <bitfield name="LPMSUSP" caption="Link Power Management Suspend Interrupt Enable" mask="0x200"/>
        </register>
